test-automation/src/test/taurus/tests/api/component tests/manager promotion/Millennial Madness_execution.yml
---
settings:
    env:
      BASE_URL: http://localhost:8080/bank
reporting:
  - module: junit-xml
    filename: result.xml
    data-source: pass-fail
modules:
  cloud:
    report-name: Millennial Madness Test Report
    test: Millennial Madness Test
execution:
  - scenario: Millennial Madness with Account Type (Blue), Age (), Balance (), Rating (644), and Years (4)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (26), Balance (), Rating (653), and Years (5)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (28), Balance (-1522), Rating (907), and Years (5)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (30), Balance (2600), Rating (828), and Years (5)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (29), Balance (9108), Rating (805), and Years (5)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (10), Balance (), Rating (667), and Years (2)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (14), Balance (-7630), Rating (966), and Years (5)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (4), Balance (1633), Rating (641), and Years (3)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (3), Balance (5931), Rating (965), and Years (5)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (53), Balance (), Rating (768), and Years (3)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (60), Balance (-1212), Rating (827), and Years (5)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (53), Balance (4863), Rating (816), and Years (3)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (72), Balance (-3360), Rating (816), and Years (3)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (100), Balance (3202), Rating (866), and Years (3)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (74), Balance (8281), Rating (972), and Years (2)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (4), Balance (66896), Rating (240), and Years (5)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (47), Balance (31116), Rating (56), and Years (4)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (66), Balance (61424), Rating (488), and Years (5)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (), Balance (), Rating (310), and Years (2)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (36), Balance (-2581), Rating (75), and Years (4)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (44), Balance (-3996), Rating (396), and Years (3)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (90), Balance (-3971), Rating (209), and Years (3)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (15), Balance (107), Rating (84), and Years (3)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (63), Balance (1372), Rating (252), and Years (2)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (71), Balance (3568), Rating (404), and Years (4)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (16), Balance (5767), Rating (248), and Years (3)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (30), Balance (7532), Rating (241), and Years (5)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (7), Balance (-1130), Rating (586), and Years (2)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (), Balance (7464), Rating (534), and Years (2)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (), Balance (), Rating (), and Years (5)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (), Balance (7903), Rating (256), and Years (48)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (22), Balance (3471), Rating (598), and Years (35)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (), Balance (), Rating (), and Years (22)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Blue), Age (), Balance (), Rating (), and Years ()
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Gold), Age (67), Balance (), Rating (704), and Years (2)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Gold), Age (88), Balance (5198), Rating (328), and Years (3)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Gold), Age (), Balance (), Rating (507), and Years (4)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Gold), Age (23), Balance (24773), Rating (310), and Years (23)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Gold), Age (), Balance (), Rating (), and Years ()
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (), Age (), Balance (), Rating (), and Years ()
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Platinum), Age (62), Balance (5950), Rating (192), and Years (3)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Platinum), Age (), Balance (87497), Rating (545), and Years (5)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Platinum), Age (), Balance (-2827), Rating (599), and Years (4)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Platinum), Age (), Balance (4115), Rating (568), and Years (3)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Platinum), Age (45), Balance (7164), Rating (698), and Years (17)
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1
  - scenario: Millennial Madness with Account Type (Platinum), Age (), Balance (), Rating (), and Years ()
    concurrency: 1
    ramp-up: 1s
    hold-for: 0m
    iterations: 1